NordicPlayground/nrf52-ble-image-transfer-demo/main.c
    // Build advertising data struct to pass into @ref ble_advertising_init.
    memset(&advdata, 0, sizeof(advdata));
    advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    advdata.include_appearance = false;
    advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    memset(&scanrsp, 0, sizeof(scanrsp));
    scanrsp.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    scanrsp.uuids_complete.p_uuids  = m_adv_uuids;

    memset(&options, 0, sizeof(options));
    options.ble_adv_fast_enabled  = true;
    options.ble_adv_fast_interval = APP_ADV_INTERVAL;
    options.ble_adv_fast_timeout  = APP_ADV_TIMEOUT_IN_SECONDS;

    err_code = ble_advertising_init(&advdata, &scanrsp, &options, on_adv_evt, NULL);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(CONN_CFG_TAG);
}


static void data_len_ext_set(bool status)
{
    uint8_t data_length = status ? (247 + 4) : (23 + 4);
    (void) nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, data_length);
}


static void gatt_mtu_set(uint16_t att_mtu)
{
    ret_code_t err_code;

    err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, att_mtu);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for placing the application in low power state while waiting for events.
 */
static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}

void cpplibLogFunction(LogSeverity severity, char *module, uint32_t errorCode, char *message)
{
    printf("%s - %s\r\n", module, message);
}

#define TEST_FILE_SIZE 2000
#define IMAGE_MAX_SIZE 150000
uint8_t test_file[TEST_FILE_SIZE];

uint8_t jpg_buf[IMAGE_MAX_SIZE];

/**@brief Application main function.
 */
int main(void)
{
    uint32_t err_code;

    // Initialize.
    err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);

    uart_init();
    log_init();

    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    printf("\r\nUART Start!\r\n");

    nrfSystem.setLogHandler(cpplibLogFunction);
    err_code = ble_advertising_start(BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);

    data_len_ext_set(true);
    
    gatt_mtu_set(247);

    myCamera.open();
    myCamera.setResolution(OV2640_320x240);
    
    // Enter main loop.
    for (;;)
    {
        uint32_t image_size;
        ble_gap_phys_t gap_phys_settings;    
        
        //power_manage();
        switch(m_new_command_received)
        {
            case APP_CMD_SINGLE_CAPTURE:
                m_new_command_received = APP_CMD_NOCOMMAND;
                //ble_its_send_file(&m_nus, test_file, TEST_FILE_SIZE);
                printf("Starting capture...\r\n");
                myCamera.startSingleCapture();
                image_size = myCamera.bytesAvailable();
                printf("Capture complete: size %i bytes\r\n", (int)(image_size));
                
                if(myCamera.fillBuffer(jpg_buf, IMAGE_MAX_SIZE) < IMAGE_MAX_SIZE)
                {
                    printf("Readout finished!\r\n");
                    ble_its_send_file(&m_nus, jpg_buf + 1, image_size - 1, m_ble_nus_max_data_len);
                }
                break;
            
            case APP_CMD_START_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;

                printf("Stream mode enabled\r\n");                
                break;
                
            case APP_CMD_STOP_STREAM:
                m_new_command_received = APP_CMD_NOCOMMAND;
                m_stream_mode_active = false;
                printf("Stream mode disabled\r\n");
                break;
                
            case APP_CMD_CHANGE_RESOLUTION:
                m_new_command_received = APP_CMD_NOCOMMAND;
                printf("Change resolution to mode: %i\r\n", (int)m_new_resolution);
                switch(m_new_resolution)
                {
                    case 0:
                        myCamera.setResolution(OV2640_160x120);
                        break;
                    
                    case 1:
                        myCamera.setResolution(OV2640_320x240);
                        break;

                    case 2:
                        myCamera.setResolution(OV2640_640x480);
                        break;

                    case 3:
                        myCamera.setResolution(OV2640_800x600);
                        break;

                    case 4:
                        myCamera.setResolution(OV2640_1024x768);
                        break;
                    
                    case 5:
                        myCamera.setResolution(OV2640_1600x1200);
                        break;
                    
                } 
                break;
                
            case APP_CMD_CHANGE_PHY:   
                m_new_command_received = APP_CMD_NOCOMMAND;
                printf("Attempting to change phy.\r\n");
                gap_phys_settings.tx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
                gap_phys_settings.rx_phys = (m_new_phy == 0 ? BLE_GAP_PHY_1MBPS : BLE_GAP_PHY_2MBPS);  
                sd_ble_gap_phy_request(m_nus.conn_handle, &gap_phys_settings);            
                break;
            
            case APP_CMD_SEND_BLE_PARAMS:
                m_new_command_received = APP_CMD_NOCOMMAND;
                ble_its_ble_params_info_send(&m_nus, &m_ble_params_info);
                break;
            
            default:
                break;
        }
        
        if(m_stream_mode_active)
        {
            while(ble_its_file_transfer_busy());
            if(m_stream_mode_active)
            {
                myCamera.startSingleCapture();
                image_size = myCamera.bytesAvailable();
                if(myCamera.fillBuffer(jpg_buf, IMAGE_MAX_SIZE) < IMAGE_MAX_SIZE)
                {
                    ble_its_send_file(&m_nus, jpg_buf + 1, image_size - 1, m_ble_nus_max_data_len);
                }
            }
        }
    }
}


/**
 * @}
 */
